#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0cf21eb6593d6523d]
aws_vpc.main: Refreshing state... [id=vpc-0cd21d96d7aef2642]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-010b1cf28d3a93912]
aws_security_group.allow_http: Refreshing state... [id=sg-04d8a7282c72afcaf]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0cd7b12f78b32e7e4]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-065d322dd00c1b789]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0318dd82fac0b27c5]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0d369c6e24d50272c]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0428fe3a02398af64]
aws_security_group.elb: Refreshing state... [id=sg-08a832d7554c2674a]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-07ec3ea398ac9f748]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0c4a5d67229b4a1e6]
aws_route_table.private_route_table: Refreshing state... [id=rtb-024f90ef3f982e45f]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-094553c80ce1daeee]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-016cf2071acfc3b27]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230124155608822100000002]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03e0ae0d3a9b2b0ea]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0934609cc271db46a]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=ASG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "auto_scaling_group" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:759579629124:autoScalingGroup:d13ed02a-f483-4ed1-a86c-2e66f591377d:autoScalingGroupName/ASG" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      - enabled_metrics           = [] -> null
      ~ id                        = "ASG" -> (known after apply)
      ~ launch_configuration      = "terraform-20230124155608822100000002" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
        name                      = "ASG"
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::759579629124:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.ec2_config must be replaced
-/+ resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:759579629124:launchConfiguration:cd6fd2d2-b22b-47b4-83c7-59f8db04225c:launchConfigurationName/terraform-20230124155608822100000002" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230124155608822100000002" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "terraform-20230124155608822100000002" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - user_data                        = "4dcc3be16dc9633d5316a58409f25972d2895ba3" -> null # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*